Revit 2027 API
RebarShapeDefinitionBySegments.SetSegmentVariableDirection Method
 Remove the fixed direction from a segment.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSegmentVariableDirection(
	int iSegment
)
Public Sub SetSegmentVariableDirection (
	iSegment As Integer
)
public:
void SetSegmentVariableDirection(
	int iSegment
)
member SetSegmentVariableDirection :
        iSegment : int -> unit
Parameters
iSegment Int32
 Index of the segment (0 to NumberOfSegments - 1).
Exceptions
Exception | Condition
ArgumentException |  iSegment is not between 0 and NumberOfSegments.
Remarks
 The segment's angle will be allowed to vary, with a range of 90 degrees. The segment must have at least two constraints.
See Also
Reference
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace